Hey, how's it going? Good, good. How are you? Yeah, not too bad, not too bad. Nice uh nice to know that we've got Basel kind of done and out of the way. Thanks everybody for listening to the show. It's one of our most popular shows. on record Uh Jason, what do you say we go in kind of the opposite direction with this show? Sure, let's do it. So this week we're thinking cheap watches. So cheap of course is relative, but I think within the scope of either like decent quartz watches or entry level automatics, sub two hundred and fifty dollars is a pretty good target to shoot for, wouldn't you say? Like that's that I think would be within the range. I'm trying to remember like my earning potential when I was in say late high school university. I think if I really wanted to, if it was a goal of mine, I I could have scraped together 20050 bucks. Yeah, I I think that's a good level. I think it's also kind of a good challenge for us. I think especially coming off of you know SIHH and Basel, I think 250 kind of gives us a little bit of a I don't know, bit of a an interesting sort of uh challenge to to shoot for watches in that range because it's it's not the range that we you know are typically looking in and yet there's some some kind of cool pieces in that area. Yeah, for certain. So uh I think before we dig into that we'll just do our normal kind of uh new business. We've both got some trips coming up that I think need some kind of preamble before we end up reporting on it later. Uh so w what have you got coming up in the next little while? Yeah, so actually next week uh I leave for the Caribbean. Uh it's a dive trip that um I'm going on to uh an island called Saint Bart's, like Saint Barth Bartholomey, I think is the the full name. Yeah, it's uh it's French for playground of the rich and famous, I think is what it means in French. I think most people kind of know it because it's it's kind of one of the swankier zip codes in the Caribbean. And uh anyway, Richard Meal does a a trip there every every April I guess for uh like a sailboat regatta that I think they sponsor one of the teams and they might be like a timekeeper or something for the race. Cool. And so they usually bring some some folks down to kind of you know sip champagne and and watch uh really expensive boats uh narrowly miss each other. But I I'm actually going to be diving there for three days. Um my wife Gishani who does most of the photography for for the dive reviews that I do is also coming and so we're gonna be doing about 10 dives down there, which I'm really excited about because I d I dove there a couple of years ago just across the way on on the nearby island of St. Martin and it was surprisingly really good diving. And so I'm curious to see how St. Bart's is, but the other reason is I I get to wear uh a Richard Meal dive watch. Oh wow to to to dive there. Yeah, it's the it's the RM thirty two and it's it's the titanium version, it's it's a flyback chronograph. Um uh it's it's pretty special to be able to dive with that watch. I mean I I'll be the first to admit that Richard Meal is not really in my wheelhouse in terms of the kinds of watches I usually, you know, am interested in or remotely can't afford. I think it costs probably half of what my house costs. But you know, cool watch, great. Neat opportunity to be able to to take a watch like that that that's just so incredibly engineered and just stratospherically priced and it's it's the kind of piece that, you know, when you see it at SIHH you you know, you just think, does anybody ever take this diving? And and I guess uh I guess I'll get to find out how it does. So just you know, I hope the the spring bars hold and and the you know I screw the crown down properly before I go, but uh should be should be fun. Yeah, I mean Reach Armell is one of those ones where they make these, you know, balls to the wall, really crazy designs, lots of technology. And then I mean they have a history of kind of strapping them to some dangerous wrists. Yeah, right. Johan Blake and uh Yeah, Rafa Nadal. Yeah. Rafa Nadal. Bubba Watson, the golfer. Yeah. Exactly. Yeah. So I I I think you're in good company and yeah I I feel like they're gonna have a Richard Mill sort of spring bar setup. It'll probably made out of like some sort of particulate nanotube and and you know yeah be a essentially indestructible, which is is gonna be just about perfect. Uh I I'm excited just to see the photos, let alone to hear how the trip is, 'cause you know, that's that's a nice ritzy location. But yeah, like you said, sipping champagne, you know, dockside while you watch the boats isn't really your jam. Maybe for an afternoon.. Yeah Yeah. Or or an hour or two. But I I think it's awesome that uh you and Gashani get to head down there and shoot shoot some photos and dive with uh with a watch that I mean otherwise probably the closest it gets to water is like if the guy stays inside his Ferrari when it's at the at the car wash or something like that. And they're just very you know they're very you know nouveau riche sort of watches and and they have that kind of ethos. So it's it'll be a really fun story to see one uh underwater. Yeah, and then um actually my it'll be my birthday when we're down there next week and uh um actually on my birthday which is Saturday the fifteenth I'll be um crewing on on the Richard Mill sailboat during during the race, so oh very cool. That's a nice little birthday present. It is. I mean it'll be a really great memory to kind of have um something I you know won't do again obviously and you know I I I am a little wary about wearing the watch while crewing on a sailboat I, had a mishap or a near mishap with my Rolex a couple of years ago where the bezel flew off and you know certainly could have been a lot worse. But a borrowed hundred thousand dollar watch is is feels a little risky, but they they said, you know, go ahead and wear it. I'll have to find a find myself a new co-osth. Yeah, right. Or we'll just retire the show at sea. Exactly, right. Yeah. You've got a a trip uh uh coming up just a couple weeks later that's uh uh diving but it's uh probably kind of on the opposite end of the the spectrum. It's a little more Spartan. W'hyt don you? tell us about that one Yeah, so I'm I'm I'm going on kind of one of these once in a lifetime sort of opportunities. It's uh it's with Oris. I'm going with a member of their uh like somebody who who was part of an Oris club that won a a gift prize. So I I'm going to cover this kind of two week live aboard experience on a boat to Clipperton Islands and Socorro Islands, which are in the uh South Pacific. Um so we leave from the very bottom of the uh Baja Peninsula, so down down by um Los Cabos and and and that area. And from there we it's eighty hours under motor to where we'll be diving for uh for a few days and then another kind of long trip to Socorro where we'll be diving again and and you know it's uh shark tagging and some kind of marine wildlife exploration and and tracking and some beach cleanup. It's kind of a mixed thing. I I'm not gonna kinda go into a ton of the details because if I'm really honest, I don't know that much about what the scenario is gonna be. The boat looks lovely. Oh wow. And I'm gonna get uh uh nitrox certified on the way 'cause what what else are you gonna do with eighty hours? So that'll be a little And I've got uh a bunch of uh I got all my gear serviced and I've got the uh GoPro all rigged up for underwater. So it should be a great trip. Obviously when I when I get back kind of mid May we'll do a f a full thing about what the trip was actually like and and I'll try and maybe share some audio from I don't not really sure yet, but we'll we'll find some way of of sharing some of that either through the normal channel or maybe through some uh new avenues for the Greenado. Uh but that's with Oris. I couldn't be more excited. It's it's well outside of my comfort zone. I mean it's two weeks without uh except for an emergency, the ability to say even call home. Wow. Yeah. And and and that sort of thing. And it's it's it's really uh very remote, but it's also that's that sort of thing that I've since I was a very little kid kind of romanticized that uh Steve Zisu sort of out in the middle of nowhere, uh, you know, blue water, white death, tracking sharks, that sort of thing. So man. I I I'm I'm very excited. I have trouble actually just kind of putting all of my thoughts together because my brain goes in a million different directions when I start thinking about the trip. But that's in um in uh a little over twenty days and I'm still kind of arranging various pieces of gear and how do I get it all down there and and and and then get it on the boat and and I'm I'm very excited and and the the overall expedition looks really cool. You can go to dive clipperton dot n two picks dot com or just greenado dot com and hit the show notes and you can get a better idea of the overall mission and and who's involved as far as sponsors and what the goals are. But uh it it looks uh like an amazing way to do a little bit of citizen science sort of programming and uh and and get hopefully up close to some sharks. There's you know uh a group of hammerheads that apparently live and migrate in that area and then some whales as well. So that would be all sorts of dreams come true in uh in such a short period of time. So wow. It sounds really awesome. I mean I I I know you and I have you know, we we talk a lot about books and movies and and so many of the stories that we read and and the movies that we watch, you know, a couple of the that you mentioned, um, you know, they're all about trips like this. Um, you know, Blue Water White Death is is such a great example of uh it's a movie we've talked about on the show before and it's uh um you know it's it's just kind of a grand adventure and I think the fact that you're you're not quite sure what to expect or how to pack for it is probably it's probably just about right. You know, you'll get on the boat. Yeah, it's part of the fun and um yeah, can't wait to hear about it. That'll be great. Yeah, for sure. Uh anything else new on on your list? Anything uh new acquisitions or plans or anything? Well, you know, funny you should mention I just part of sort of an early birthday gift my wife uh uh presented me with a a bottle of some very nice whiskey. It's uh it's an Aberfeldi. It's a a twenty one year old uh single malt and And you know, it it came in a beautiful box and and it's a beautiful honey color and I just I just kind of peeled off the wax just before the show. So I'm sitting here with a very small glass uh as we're speaking here and I've taken a couple sips of it and it's uh uh it's pretty special stuff. I think it's gonna be one of those one of those scotches that I definitely will savor. There are some that, you know, you you kinda drink more regularly, but this is probably one that'll last until until next year about this time, if I'm if I'm patient and have some self-control. But it's it's it's pretty amazing stuff. So um I've had I've had what I I think it's their eighteen. Oh not the twenty one, but uh you know it was it was a an older one and I remember it being very uh very good. It short certainly upstage is my uh Tetley tea that I'm enjoying currently. Taking care of these uh not so much golden pipes, we'll say tin pipes. Yeah. Trying to bring the best to the microphone. Yeah. Right. And uh and yeah., that's great That's I mean another great birthday gift. That's uh fantastic. Yeah. Yeah. That's and it's nice nice to have something like that just to kind of really slowly enjoy and appreciate it. So many years went into its creation because I it some people don't realize, but the uh I'm sure a lot of our listeners know way more about Scotch than I ever will, but the uh it's twenty one years is the minimum age of the ingredients. Yes. I mean that's a significant amount of time. Oh sure, yeah. That's almost half my life. And it's well over half your life. So I mean this is I you know, you just trace back to to what you were doing twenty-one years ago, and it's uh it's pretty amazing this stuff was was just being put in a cask back then. So I was kicking around in the woods with a slingshot and a pocket knife and like a whole sleeve of saltine crackers. That's what I did when I was that old. How about you? You're you're you've got some new gear maybe for for the Clipperton trip? I I got a problem, man. Sometimes you think your my problem is watches or like jackets or or camping gear that I have yet to really use. I keep amassing more camping gear, but my let's be honest, my real problem these days is cameras. Oh yeah. So I've bought another camera and uh even casual listeners because I bring it up so often, casual listeners will remember I just bought another camera. I just bought a Fuji uh X one hundred T which I love very much um for photography it's very, much like a photographer's camera with all the manual controls and it's kind of a really beautifully built body. But what I found is after doing the vlogs with a blog to watch, I I really wanted to have more of an ability to shoot kind of quality but on the fly video, something a big step up from what the GoPro can offer, but not a lot bigger. Yeah. You're too kind to say it, but I'm sure you're very tired of the amount that I've been talking about cameras and our Slack chat but I uh I I finally uh pulled the trigger so I bought the new Sony uh A60500 so it's their small magnesium bodied uh APSC camera and uh it shoots uh four K from a down sampled six K sample, so it shoots beautiful video and they have a fantastic reputation and uh you have some experience with the E or I guess with your cameras, it'd be the F E mount.. Yeah But there's actually a wider selection of lenses than I expected. You get kind of spoiled if you're in the Nikon or Canon world because there's just so many lenses you could choose from. Old, new, expensive, cheap, and and I was surprised to see that, you know, even though the NEX and then now the Alpha platform has really only been around for it's less certainly less than ten years. They have a pretty wide range of lenses. And uh so so I have the camera and a couple extra batteries and I and I bought the kit lens, which seems like it will do really well for sort of photojournalist video. Like I'd like to shoot some video on the Clipperton trip so that you can see what it's like on the boat and not just when I'm diving with the GoPro. Yeah. So that that comes in in a couple days. Unfortunately it probably means I'm gonna have to move the Fuji. Just too similar in terms of size and the way that I'll use them. The Sony will take a beautiful wrist shot and and do those sorts of things for me as well. Yeah. I'm gonna miss the Fuji because again the Sony feels more like um like a computer that you attach a lens to. I mean it's a touch screen. It doesn't have a lot of like physical controls for the I mean it has them but they're just kind of buried into kind of remote control esque buttons. Yeah. Unlike the Fuji where you have a big ring for the aperture and another one for the shutter speed. This is a little bit more of a computer approach to photography, but it does have the the uh EVF, the electric electronic viewfinder, which will be uh nice to use and great big touch screen for focusing. So I I'm I'm excited to uh to kinda come to terms with yet another platform but, something tells me I I I may uh I may be slow to actually list the X one hundred on Craigslist 'cause I I've really loved having it and just kinda keeping it under my arm as I walk around town. Yeah, I think uh you know, as we've discussed m many times over, um, I think b on both of our ends, uh it's really tough to find just the perfect camera. It's uh I think I've described it as it's kind of like a puzzle. Uh you uh you w especially in your situation where you you want to be able to shoot video and you like kind of the feel of a an SLR or a camera that has some manual controls and you want the ability to shoot some good still shots, uh it's just really hard to find great stuff out there that can do it all. I I guess you know you've had some experience I guess with the Mark IV D but but you know maybe not as as portable or light. The you know the Fuji does one thing well. The GoPro is going to be great for underwater but isn't the best thing for topside and then you've got to deal with microphones and uh so yeah, I'll be curious to hear your thoughts. I think I it sounds like it's a good purchase. I mean y it it won't be for lack of uh of research. I know you've you've really looked into this a lot, so yeah, I've I've dug around a lot. I think I've watched almost all the YouTube videos about these cameras and the 6300 looked like a pretty great buy, but with the 65 out, and I just want to have in this situation kind of the best one I can, it wasn't that much more money, so I went with the new one and I think to to kind of slot in between the canon, the Mark III that I have, which is fantastic for photos, and I love shooting watches with it, and cars and all sorts of stuff, and then the GoPro at the other spectrum, which is just fairly straightforward and simple to use and and obviously does things like the underwater or you know situations where you wouldn't dangle a different camera. Yeah. Um and I think to put something right in the middle, the 6500 looks like a good option. I probably won't invest much in lenses. I'll stick with the kit lens for now and then maybe maybe find something for a very specific purpose later. Or or just go with the ultra wide. They make a 10 to 18 that looks great and is seems seemingly very sharp. So the you know lot lots of options, and and obviously the nerd side of my fascination with cameras loves the fact that I'm now moving on to yet another platform. But I did really enjoy the X100 and it's you know it was a fixed lens, so I didn't have to think about the DSLR aspect of like changing lenses or switching lenses. You just kinda operated it similar to a 35mm and uh and and I like that, but I'll I'll report more obviously once I've gotten a chance to get the camera and use it and hopefully we'll have some fun video or something to share post Clipperton. Uh providing I don't mess it up or dunk the camera in the ocean or who knows. Fingers crossed from all that kind of stuff. Yeah. Well that's exciting. I mean there are there are certainly far worse vices to have than uh than you know, flipping and collecting cameras and I think uh you know, you're someone that'll use it and use it well and even if it's just for this one trip and and you get some good footage out of it and then sell it when you come back. I mean who knows? Um Yeah, we'll see how I like it. Yeah. Well let's move on to some watches, huh? Yeah, let's let's hit the main topic. So again, as a palate cleanser for kind of the end of the big show season, we're talking watches under two hundred and fifty dollars. I think for our intents and purposes, you know, with the Grenado, two hundred fifty dollars represents a cheap watch. And I think you'll find that we have watches so far under that limit that it would be hard to to really claim that we're really too far out of touch by saying two fifty is cheap. I think w the list that we've kind of amassed is not exhaustive, but it has something for everyone. Yeah, I agree. And I think um Sub-250, it's kind of you know, I think when you first kind of proposed this show topic a while back, I I thought, can't we can't we kind of up the limit to five hundred? Because w when you move up to sub five hundred, there just are a lot more I guess obvious choices. And I think at two fifty you have to look a little harder, but you end up with some really satisfying watches that you know, uh pretty much any of these on our list that we're gonna talk about I would I would happily wear in in many situations. So Yeah, we tried to we tried to limit our list to not necessarily the best watch from any brand that we mentioned, but the ones that we would wear on our wrist and might even spend our own two hundred and fifty bucks on. So for international listeners and for myself, it's two hundred and fifty USD. So if you're spending Canadian dollars like I do, that's a bit of a bummer. It's a little bit more. But using most of retail in North America is going to roll on the USD. So I I think it's fairly accurate, especially when you you start to look at the a lot of the pricing from gray market options out of uh Southeast Asia are also readily in USC. So I think that's a fair currency as well. So there's a few stipulations. It's not an exhaustive list. If you have a really great idea for a sub two fifty watch that we missed, just write us at thegraynado at gmail dot com. I'd be more than happy to come back to this in a few months and talk about the sub two hundred fifty watches that listeners actually wear and have abused and have taken all over the world. With that in mind, uh you want to hit the first one on the list for us? Yeah, well, the the the first one that I have, I I I I think it's kind of an interesting or a uh maybe a fitting follow-up to your upcoming Clipperton trip and um the fact that it uh it's a watch that uh people might be familiar with from the Steve Zisu movie. Yeah from Life Aquatic. Yeah the Life Aquatic it's the Vostok amphibia. And you know, Vostok is uh a Russian uh watch brand that's been around for a while and the amphibia is a watch that I think would be familiar you know if you if you can't picture it, it's it's almost a it it doesn't really look like anything else out there. No, it really doesn't. It's a dive watch. Um, but there are a number of sort of different dial variations with kind of funky, almost cartoonish patterns on them. Some have anchors, some have kind of some real um, you know, interesting fonts and texts. Um but the bezel has sort of it almost looks like Morse code, it's sort of dashes and dots in red and blue, uh and black in some cases. And you know, it's it it's um i I wouldn't say it's uh c you know, I haven't I I've handled one maybe once and and it it, you know, it felt like a decent little watch. It it's certainly g not gonna be at the quality of maybe what you could get in this price range in a in a Seiko, but if you want something that doesn't really look like anything else and it's kind of an interesting talking point, or maybe you're a Steve Zisu fan, they're like eighty four dollars on Amazon. So I I I think that's kind of a it's one of those watches where if you buy it and you don't like it, you're you're just not out that much money and and it's certainly kind of a fun piece. So that that's kind of my first foray. Yeah I think these I think these amphibias are g not not that expensive and this is kinda like at eighty four. I'm actually looking at about five others that are under eighty. So there's a ton of versions. They would get even cheaper if you decided to go second hand. Oh yeah. And I think they're just kind of a fun uh a fantastic beater if that's what you're looking for. Uh I don't think you'd have to worry about abusing a watch like this. I think you could wear it like you would a G Shock. Yeah. And uh, you know, simple mechanical movement and a sim a lot of them just come on a straightforward bracelet or rubber. They're nicely legible, they don't like Jason said, they don't look like anything else. And I think that's a great great spot to kick it off. We're well under a hundred dollars.. Yeah And well, well below our two hundred and fifty dollar limit. Uh for the next one on the list, I I would actually go with the kind of gold standard of the entry level automatic, which is the Seiko SKX double O seven. Yeah. A watch everybody should own. Yeah. I if you don't have an SKX and you haven't owned one, I would actually just say that like you're kind of denying yourself one of the simple pleasures of di of like sport watch appreciation. And you know, you're looking at gray market sites that we checked on online at about 190 US dollars, including shipping. Amazon's got them for like two ten. And I've seen them for not much more than that, like still under two hundred and fifty dollars in retail. Mm-hmm. So I mean if you're gonna be on a cruise anytime soon, a good time to scope out what they've got as far as uh Seiko's and and that sort of thing, easily found under two hundred and fifty dollars, an absolutely killer watch. Mine just went in for service at eight or nine years. It was still keeping reasonable time if you just measured it again. 'Cause I mean there uh you know no hacking, so you're not really zeroing the seconds that carefully. And then put it on the machine and it it had some amplitude issues, so they're they're fixing it. But just a bulletproof watch, you could mod one about 10,000 different ways if you didn't really like the aesthetic but wanted to maintain that kind of build quality for the price. Yeah. And uh and and just a winner. Yeah, it is it is i I would even say if we were to do a show at sub five hundred dollar watches, this would easily stand shoulder to shoulder with anything else in that category as well. It's it's just such a fantastic uh piece. And you know, you mentioned the timekeeping and I think, you know, you have to set good expectations when you're talking about watches in this price range, especially the the mechanicals. Um you know, we're not talking chronometer certified watches here or or even um you know really great timekeeping. Some of them will will do well. Um you mentioned your double seven isn't too bad, but uh you know, I'd say, you know, on average probably with with a lot of these you were talking plus or minus thirty seconds a day might be a reasonable expectation. I think the seven S twenty six that's in these SKX models and in a lot of the Seiko 5s that we're going to mention um is is yeah is rated to plus minus 20 seconds. So 40 seconds spread really I mean if you want more than that at the price point you will probably have to go courts. Yeah. I I've seen a lot of guys online, you know, go into the six R movements from Seiko, which are a couple levels above the seven S twenty six and even those with careful regulation don't really deliver the same sort of performance that you would kind of more readily expect of something like an EDA twenty eight twenty four. It obviously depends on who's fine tuning them and and how well the movement was made originally. There's some variance in uh in the kind of more entry level Seiko movements. But within that variance of say maximum somewhere around forty seconds a day, mine ran like that for many, many years. Yeah. Yeah. Uh with a ton of abuse. Yeah. And if you want something ever so slightly better, we were able to find the SRP seven seven uh five, which is the gold the one with the gold accents. Mm-hmm. Which is the the turtle, the watch that we love is r the now a a turtle of the seven seven seven and the seven seven nine is pretty readily available at say two seventy five? Yeah, um uh yeah, closer to three hundred. So if we if we kind of tweak our our price range a little bit and and people stretch a little bit, um you know the triple seven, the one that we like, of course, uh you can find ever all day long at that price. Yeah, so I mean if if if you are wanting something you already have a 007, you want something with slightly different aesthetic, only slightly really, or you want something with a slightly better movement, you know, you move into a four R series movement with the seven seven X's. Uh we were able to find the seven seven five for a two hundred and forty five dollars, so just barely into our price point. It's up to you whether you like the gold. If not, I mean for the cost of you know, a kind of a cheap dinner, you could be at the at the next one. I don't really want to bend the two hundred fifty price point too much, but if you are going to bend it for a watch, do it for the seven seven seven. Yeah. Yeah. I think you know, stick with Seiko. I mean, we've you've got a a a list here. I mean the Seiko five is kind of the another kind of classic uh category for Seiko. It was kind of there that's been around since I think the 60s or 70s and it's it's always been there there, you know, if you talk about Seiko being a bargain, the Seiko f isive is the real bargain basement of Seiko's and yet they're they're still such sturdy fantastic watches and you've got a few listed here. You've got the solar patty one. Yeah so the uh with a lot of these these are now we're into the the meaty zone of the stuff I recommend to my non watch nerd friends. So when somebody comes to me and they go, Oh, I r I want to buy a watch and and you know watches what what would you buy? I usually say, Oh well, you know, what do you want to spend? And if they come in under two hundred, two hundred or three hundred dollars, which is almost almost always they do, I just say, Oh, well you you know, go with uh go with a stake oh five. And so if you look at one uh one that I've recommended now to four or five people, and none of them have had an issue with it, and all of them wear it every single day. Like it the these are one watch folks, not watch nerds. Yeah. This is the SN uh ZG fifteen J. There's like four or five different versions. So this is a a 41mm kind of pilot style field watch. Simple steel case, super legible, got some loom, day date. You can't beat it, it's a hard lex crystal, you get 100 meters water resistant and you're looking at a hundred and uh twenty-five dollars, a hundred and twenty five US dollars shipped from uh uh I found them on several of kind of the popular gray market retailers, but if if you want specifics, this is via creation watches, which I think is out of Southeast Asia. I've bought uh probably more than ten watches from them over the years and never had an issue. Yeah. Uh and and so that you know that's an option. You also if you want something a little bit more diver-y, you have the kind of what's called the baby monster, the Seiko 5 SRP 481. But again, there's a several versions. This is just one. It has a white dial with kind of blue accents. And that one you're looking at $154. And that's also that's a little bit bigger at 43 millimeters. A 4R36 movement for that money is fantastic. Hard Lex Crystal, 100 meter water resistant that comes on a full bracelet, kind of a monster style bracelet, which is a great bracelet. And then if you want something even more uh fuss-free, Seiko makes a bunch of these solar divers, so for fun, I just picked a random one that was on the site, and this is the SNE 435. And it's a paddy, so it's it's I actually think it's a great color scheme. Maybe one of the better paddy color schemes. Yeah. It's really cool. Yeah, yeah. Forty three point five millimeter uh steel case uses a solar movement, the V one fifty seven Seiko solar movement, and otherwise just a straightforward two hundred meter water resistant dive watch, two hundred and ten bucks. Perfect dive and absolutely so many great options. Yeah, I mean it's like uh a two hundred meter dive watch, you know, in a steel case from Seiko I you know, for somebody who's like using it as intended as a sports watch and banging it up while they're you know kayaking or hiking or you know taking you know getting their open water certification or something, it's it's just such a perfect choice. And I think the thing about Seiko five and and same with you, I mean when it when I get questioned by people who are either just getting into watches or maybe they want to buy a gift for somebody, um i this is this is just the the it's default recommendation, the Seiko five. And that SNZG fifteen, the the first one you mentioned, you know, it has a it has a display case back. I mean that's crazy for a watch that you can get for $125. And I I always I see a that watch like and I think to myself, if you're gonna buy a gift for let's say uh a relative who's graduating from high school or something and you wanna get them kind of a neat gift and sort of maybe you're you wanna introduce them to mechanical watches,. You know here's a watch where they flip it over, they can see that the rotor spinning, um, they can see that, you know, the balance wheel, you know, flipping back and forth. And I I just love that, you know, it's the the movement is nothing special. I mean, there'sn't anything decorated about it or anything, but it's it it introduces people at a such a low price point to what a mechanical watch can be, and and they'll have it for years. I think that's I think that's a great choice. Yeah, and they also make a version at I think 37 millimeters, which is much more reasonable, uh just depending on your taste. I've seen both. The 41 is great, and you still get great loom. You know, these three and and well the two plus the paddy solar, which is actually part a prospect's watch, it was great price for a prospect's piece. Yeah. I I think these are these are like cream of the crop sub two hundred fifty dollar watches. So you got to spread from 125 to 210 bucks there. Very wearable. You got different sizes. They're all Seiko, so you get good loom. And then the the only other one I would add is a watch I owned very early in my kind of watch interest career, which is the Seiko SNA411. And it's kind of like if you imagine a quartz Seiko Nava timer. Yeah. But even that it doesn't really even look that much like a Nava timer. It's just a this kind of burly pilot's chronograph with a very deep dial. Mm-hmm. It comes in an all black dial, which is the the four eleven is an all black dial with uh yellow accents. And it's a great quartz chronograph. Uh I I gave it to my brother after I kind of not lost interest in it, but it had too many other watches. Yeah. And I believe he lost it somewhere, left it at the gym and then it was gone, but somebody out there still has that watch. It would be indestructible. It just needs a battery. Yeah. And those are about two hundred and five bucks. That's about what I paid many years ago. An embarrassing seven, eight, nine years ago. And it also comes in a version with kind of like a panda sort of white dial with blue sub-dials. I would call it like a Tommy Hill figure. It's got red accents. Yeah. Yeah. And then there's like a full plated gold version with the black if you want to go full flash. Those are the ones you see on like cruise ships. Oh sure. I don't remember what they are. It's the SNA4 something, 17, 15, I'm not sure. But the the four eleven I think is actually a really cool watch that you don't hear that much about. Yeah and it's a chronograph and it's an alarm and it's two hundred meter water resistant. So you know, yeah, just just a great bang around watch and it it kind of looks cool. It's got the slide rule bezel and Yeah. Yeah. And yeah, that's one of those ones you size the bracelet and you're done. Yeah. But I bet I bet you know, you'll get at least a few years out of it and then the battery's gonna be like a twenty dollar thing. Yeah. At at a at a at a store and and and and you're ready to go again. Yeah. You know, Seiko's kind of the default choice of this category. I think another obvious hit in the sub two fifty category is is obviously a G Shock. Um for sure. And I know you've owned a few that I I'll just chime in at first here with the one that I I'm not a G Shock fan personally. I just the aesthetics don't appeal to me, but the one that I would own, um, I think it was probably the the one that pays homage to the first one, which is the DW5600, um, which is kind of the simplest looking rectangular one, um, probably the the least bells, bells and whistles on it. Um and you've got one here listed for I think seventy dollars. Yeah, and I mean you can find 'em for less. Every now and then I've walked into a Walmart. Yeah. Well kill killing time, I mean I I I used to have family in the South and I walked into a Walmart in Mississippi and they had various versions of the fifty six hundred for like thirty five dollars US. So I mean this is just a quick Google search. If if you dig around, you can find fifty six hundreds and they come in like every color. Uh r you can get 'em in negative L C D if that's your preference, where it's a black face with kind of white letters. Yeah. And and these are bulletproof. They make atomic versions, which will cost you more, maybe as much as a hundred, hundred and twenty dollars. And then they make like fancy limited edition versions. It never ends with G Shock is kind of what I'm getting to. But the 5600 is like it's the one you see on military a lot. It's the one you see on cops a lot. It's the one that just kind of you see in everyday life kind of like in the same way as the Timex Iron Man. Yeah. There's a lot of guys that are buying them, whether they like watches or they don't, or they just think that this is the right one 'cause it's nearly indestructible, simple, not especially big, and certainly not flashy. And and I think that's their strong point. And you can even go up to uh they make a model that I found for about a hundred and ninety bucks that has like full Bluetooth connection to your phone. Oh wow. And will give you I think if I'm not sure if it vibrates, I should have checked that. That's the killer feature if you're gonna do the notifications so that it's not always beeping. But it's got a little indicator on the screen to tell you when you get an email or a call or those sorts of things. So that that could be fun depending on how you want to use the watch. It gives you that just a little just enough of the handy part of a smartwatch. Right. And I mean my my taste in G Shox lies firmly into the Protrack range, and you can find a um the triple sensor, the two seventy, which is the last generation, for like I found them for as low as a hundred and thirty, that's a lot of watch for a hundred and thirty bucks. Altimeter, barometer, compass, that's their their triple sensors, the latest generation of their ABC. Yeah. And I mean that's still like a big chunky watch and and they have a nice kind of the Pro Trecks have a really nice kind of expansive open screen that allows a lot of light and is very easy to read. Mm-hmm. And I've used a f quite a few of those kind of hiking and adventuring and they're fantastic. And you can get the newer-ish model, which is the um the three thousand series, for I found them for as little as a hundred and eighty bucks. I've seen those on Watch Recon, and I don't know why you wouldn't buy a used G Shock. Nobody's gonna do that much to it. Yeah, right. I I've seen them on Watch Recon for like a hundred bucks. You know, it's funny. You know, ship ship from some guy, and that's a lot of watch if you want to watch to beat up on the weekends, yeah. And and not not beat up some nice watch you were to work. Killer option. Yeah, it's funny. Uh you know, the G Shock always gets a pass from kind of the the watch nerd crowd at at any level. It just has sort of universal respect. And it's funny because the rest of the watches that we're talking about on our list are by and large, if not exclusively analog dial watches with uh either a mechanical or a quartz or maybe an eco drive movement or something. And yet the G Shock, you know, you're talking about the the Pro Trek watches, the triple sensors. It it it it's funny because we don't talk about uh maybe we could have included like a Sunto or you know, something like the the the Cunto vector or something like that that's a base core might be under. two fifty Yeah. So y you know, w we we haven't really talked much about digital watches in general on the show. I think you and I aren't averse to it. I think, you know, given your recent aerospace purchase and and a couple of my watches, you know, we certainly aren't averse to to a digital screen on a watch, but uh the G Shock it it kind of occupies a space of its own and I think um it it's just such a cornerstone of this price category for a lot of people. Yeah, and they're more readily found cheaper than a Sunto. I mean I've seen some Suntos on sale that were excellent, but I think that's the way to buy the Sunto. Um but yeah, I've had a a handful of protracts, I had arrangement that I absolutely adore. The arrangement costs more than $250, but not used. So I mean if you're okay with the case size, which I if I remember correctly is like 54 millimeters, yeah. That's a killer watch has all the features and is very wearable despite its size. It's kind of like a frogman if you're in in if you're in kind of the range for that. And a frogman's of course are quite expensive as well. But I also have a uh you know a Garmin, I have a couple Garmin Phoenix watches, which are quite large, but have lots of great features and are very useful. I don't wear them day to day. I do wear them kind of tool based, the same way I use my dive computer. Mm-hmm. That's how I view a watch kind of like this. And maybe that's unfair, but that's more or less how I wear uh a digital watch. Yeah, sure. His first you know, some specific use or feature, you know, whether it's wanting the chronograph when I'm cooking something or if I'm going on a hike or I'm going diving or I'm going on a run or something like that. So we've we've kind of uh you know, i Japan and Asia sort of dominates this this category for for a number of reasons and I think we've talked about Seiko and Casio and um the other big player of course is is citizen and there there are definitely some good choices in that category. You know, the the um that Seiko pilot's chronograph with the alarm that you mentioned earlier reminds me a little bit of one of my um favorite sort of citizen pilot themed watches, which is that the Nighthawk series. And I think you see a lot of those on actual pilots, on again on cops and on cruise ship sails and things like that. But the Nighthawk is another kind of killer watch, I think, in this range as well. We're kind of creeping up to the upper end of our price range, but still at you know what you have it listed here at what two twenty nine. That's a good looking watch. That's a great watch. And uh the Nighthawk is actually one of these ones that has like a really solid nerd cred. I remember it was one of the first watches I was introduced way back when I got into the internet side of learning about watches on the poor man's watch forum. Yeah. There's a huge contingent of Nighthawk fans because you're it's a 42 millimeter steel case with a date display, a second time zone, and good loom on the hands, a nice bracelet. And yeah, $230 for all I know, you wait around for a sale, it's even less. Citizens also one of these ones that's generally well represented in your local mall. Yeah. And every now and then you go to the mall and it's like a big sign that's like, oh, it's 70% off. Yeah. May maybe just keep the Nighthawk in your brain and you'll come buy one even less than two thirty. I don't know. At two thirty, it's eco drive, it has a good feature set, it's super legible, super wearable. I I I think it's an absolute winner. I mean it's I I think in some ways it's like the citizen ethos in an entry level uh piece, an entry level sport watch. Yeah. And you know, the only other one that I would say would sit along this is actually a little bit more at about three hundred dollars. It wasn't when I bought it, it was a little cheaper, is one called the BL fifty two fifty and it's a titanium uh quartz piece uh eco drive with a perpetual calendar. It's a fantastic watch. I had that one for quite some time. It was super light on wrist. I I think it's quite a uh quite an attractive watch. You can check out the fifty two fifty in our show notes. I'll I'll I'll put a link to it, despite the fact that it's over the price point. Between the two, I think my m the the aesthetic I sit with these days would be the Nighthawk. I think it would look great on a NATO. The bracelet looks very nice. And I I do like the kind of fuss-free long term l outlook with EcoDrive. I don't want all my watches to be EcoDrive, but I do really like the idea behind it and and the functionality. Well, what's what's cool about EcoDrive uh at at this price range is for for guys like us who, you know, we've got our our Rolexes and our Braymont's and things that we we tend to wear more often. The EcoDrive is the kind of thing you keep on your desk or your side table and when you want to wear it, it's ready to go, you know, so you're not d you know, fiddling around with it, setting it, things like that. And I the other thing I like about this Nighthawk too is uh you know Citizen makes uh another kind of pilot's watch called the I think it's called the Skyhawk, which is more expensive and it's it's just such a busier look. Um the Nighthawk just it it has kind of big sword hands, the big markers, it's uh it just has a more of a classic uh aesthetic to it and the the bracelet's kind of conservative. Um I I just think it's a it's a it's a killer watch. Yeah I fully agree. Um I I I picked a I've I've got a couple of Citizen Dive watches that I added to the list, um one of which is the BNO151-09L. You know, Citizen always has these and Seiko as well, these these long sort of alphabet soup names. But uh this is just sort of a classic analog dive style watch, like like you know, dive watch has been built since the fifties. It's it's the rotating bezel, it's the the broad hands, um big markers. This one is an EcoDrive with uh 200 meters water resistant. It's a a 43mm steel case with with kind of the accordion or vented rubber strap. It's just kind of a simple classic looking dive watch, which um you know, with it with the EcoDrive again, it's the kind of thing that I I always think, you know, you you pick it up when you're gonna go do some sort of water sports or or, you know, kind of go do some yard work or something on the weekend and it's there for you. Mm-hmm. And um you know just just kind of a nice looking watch. They make they make automatic versions in this similar aesthetic. Yeah the NY forty. The NY forty which you know is out of our price range. But uh if you want that same look, I I think this is the way to go. It's a great watch. Agreed. I think they look fantastic. And that one's uh about found it for about two hundred dollars on uh on Amazon. And and then the other one which is a a a bit of a favorite of mine is is in the Aqualand family. I'm a big citizen Aqualand guy. Um and Creation Watches have has the I I think it was kind of the considered the Aqualand two watch. It's the it's the watch with kind of the analog digital dial. This one um that I just chose has an orange dial. They they make some in some different colors as well, but uh it's a little bit kind of a goofy looking case. It's got some kind of garish looking lugs and things, but it has that two-window dial with with skeletonized hands and and a depth sensor. And for for someone who's into diving and and wants a watch that has a depth sensor, maybe you're using it as a backup to your computer or you just, you know, want it for fun. It pretty tough to get into a watch like this for for this price range, but but uh uh Creation Watches has it for for two hundred and ten bucks right now and and you know, you get all this stuff. You get water temperature, you get calendar, you get an alarm, you know, chronograph if you want to go running or swim laps with it or whatever. And uh you know, uh an another good choice. I think Citizens, another one of these brands that uh fits squarely in our in this episode. It's perfect. Yeah, that one's quirky and fun. I wouldn't call it pretty by any stretch. Certainly the uh the previous one that you mentioned, the BN0151090. Yeah. Goodness sakes. Yeah. Uh is a bit of a prettier diver, but for your kind of full featured pseudo dive, you know, one step under a dive computer, Citizen has a nice history with these and the Aqualam Pro Master stuff's pretty cool. Yeah. And you want to buzz through uh a few more? We got a few more brands to go through. Yeah, maybe we f we finish off uh Japan by looking at at um Orient, which which I think is uh a sub brand to Seiko and uh Uh yeah, that so I I had a Mako. I I'm actually not a huge fan of this watch personally. It's something about the the way it wears on wrist, but they're insanely popular. Yeah. You know, it's a solid dive watch at that price point and it is at a very fair price point. It's uh a hundred and seventy dollars is what the one I found, although that might be a sale price and that was uh you know, we'll we'll you'll you can find all these links in the show notes and stuff, but I think these are readily available at sale prices, basically, being being what they are. Uh but Orient makes a handful of dive watches. I had one way back in the day called a Red Beast. Oh yeah. And it used uh a citizen movement of some like a I probably what is now a Miyota movement with a little power reserve. And uh and and then I think you know, you had a saturation, the three hundred meter diver, which is well out of the price point. Yeah. But Orient it's not like Orient's only dive watch. So I mean if you're kind of on board for the way it looks, I really didn't love the way it sat on my wrist. I had one many, many years ago and uh and sold it uh shortly thereafter, but there was nothing wrong with the way it was built, certainly nice uh simple automatic dive watch, a good com good competitor to something like an SKX if you already have that or if you look at the SKX and you just can't get behind it or are so tired of seeing them on Instagram or something like that. Yeah. And uh how about uh marathon? They've got a pretty good option. Uh just a hair over two fifty. Yeah marathon's um i again if we were sub five hundred marathon would would almost win the category but uh T SAR. Yeah, exactly. But the the the navigator that that we've got on the list, the the quartz navigator, it it's got i it's got some some healthy kind of watch nerd credibility to it. It's it's uh a direct descendant, I think probably going back to the even Ben Rus uh you know, the the special ops diver watches from from the Vietnam era, up through when Marathon kind of took over from from Ben Rus and Galais and and it's that asymmetrical case. It's it's a it's a really cool watch. I I've wanted one of these for a very long time. Yeah, and it uses like uh I I believe the case is made out of uh uh nylon resin. Yeah. So it's super lightweight, you get one I believe, you know, twelve hour bezel, and just kind of all around a pretty darn cool watch. Uh super wearable. I think they look ultra military tritium design. I I think those are fun. They are just a hair outside the price point. So if you already have a bunch of stuff that we've talked about, or you feel $10 isn't too much to stretch, I think that's a a pretty interesting one to go for. And they're still kind of making them with a. sterile dial If you really like that military aesthetic, it's hard to kind of beat this look. It doesn't have a spec list that's going to stand up against the Seiko. But I do think they're really cool. I dig that asymmetric, the Benrus style case. This would definitely be something I would spend that sort of money on and wear. I just I think they're really awesome and I love a twelve hour bezel and I love the tritium. Yeah, I do too. Cool. Well maybe we should finish out with um well, we we've got our surprise picks, but uh the last the last one that that I wanted to mention is actually the only Swiss made one on the list, and that's the the Swatch System fifty one, which kind of was was a big buzz a few years ago when it came out for being not only for its price, but for a a number of other reasons, you know, being you know, I think the whole movement it's a mechanical movement, it's uh entirely built by machines and it's held together by a single screw. Um, but the price is is 150 bucks, and there's a number of you know case colors, dial colors, dial styles. It's uh it's never been my kind of personal favorite. I'm uh it's not uh you know that that aesthetic of that watch is not m to my taste, but uh a lot of people like this watch. A lot of people like Swatch and you know I I think they're well built and and it's it's a cool watch if you want something Swiss made for for 150 bucks, um System fifty one's probably the way to go. Yeah, I think uh I fully agree about the aesthetic. It's not something I would buy and wear, but it's definitely the sort of thing I would buy for someone else and that I recommend to other people. Yeah. Uh because there's such a wide kind of modern aesthetic to it. Yeah. And tons of colors, more all the time. And they have a couple that are kind of in the vein of a field watch. So if you've got somebody with a little bit more of a practical aesthetic versus some of the ones that are more hyper modern or even kind of astronomy based in their overall kind of dial design. I really love that these exist. Yeah. Um and and I would definitely buy a watch with that movement in it. They just haven't really come across one that I look at, you know, outside of kind of novelty. Yeah. I think they're very novel for me. Uh but they're not not one that I would buy and actually get much wear out of. You see a lot of kind of like heart quote unquote hardcore watch nerds just kind of buying them and keeping them in the plastic like as a oh yeah. It's a bit of a collector's item, especially when they were brand new or the first time they came to the States, that sort of thing. Yeah. Um and and I I I think they're neat and definitely a fantastic watch gift for somebody who's maybe just entering watches or really appreciates the technical attributes of the movement design and the manufacturing, or just somebody who really kind of connects with the aesthetic. Right. Yeah. Certainly cool uh to find something Swiss at that price point, no doubt. Yeah. And I think that pretty much uh pretty much rounds it up. Now we do have one added element, which is uh without telling each other, we each selected uh what what we believe to be kind of the not the best option, but a really cheap option that is also good. So maybe something we've experienced ourselves and we didn't tell each other what watch that was. So now we each have this kind of watch and we're gonna see who actually managed to come in at a less at the lesser price point. So Jason, do you want to go first or would you like me to go first? Because I'm pretty sure I won. I'm pretty sure you did too, but mine's pretty darn cheap. Yeah I'll start. So I you know, I I I have kind of a soft spot for for this watch because uh um you know, I I don't come from from a family that that had a lot of sort of handed down high end watches like like some people um omegas and things like that. And I I have some nice old pocket watches from both of my grandfathers, but uh the watch that that I did inherit from my grandfather who passed away I don't know, you know, several years ago, uh was just a hand wound uh Timex, just a time-only little Timex watch that he used to wear. And the watch that I have picked here is it looks very similar to it. It's an Arabic dial Timex. It's the Timex Expedition Scout. It is a very military-looking watch. It looks like you know like one of the kind of the military-issue watches from World War II up through the Vietnam era that that Timex. produced It's got the indie glow luminescence, it's uh 50 meters water resistant. It it comes in kind of um a number of different sort of case uh colors. They have sort of a PvD version. The one I chose is is sort of a uh it's sort of a a a matte gray. It's actually a brass case, so I don't know what it's coated with to give it that color. Sort of a gunmetalal look. look. Gun met It's it's uh uh it's just a pretty watch. It has a a uh a ticking sweep seconds hand that's in sort of a bright yellow and a small date wheel. There's a twenty four hour uh sort of military time subdial or or you know uh second scale uh below the the the 12 hour Arabics um kind of sword hands and and it it comes in kind of a neat drab olive nylon strap. So uh I I found it for sale on Target.com. So Target Stores is selling it for thirty-seven dollars and forty-nine cents. You know, just uh you know cheaper than probably if I bought this glass of whiskey that I'm sipping here at at a high end uh bar somewhere I'd probably pay more for it than than for this watch and and it's the kind of watch you could keep in in your dop kit and take traveling or or you know give to a a nephew who's graduated from high school or something like that. And uh probably get some pretty good service. Yeah. So what a great choice. I'm not gonna get any love for my choice. I think yours is uh undoubtedly a cooler watch, and you actually came really close in price. Um mine is a uh uh it's twenty four dollars and seventy three cents. Oh wow. And it's this Casio A five hundred WA one A C F. Oh and so if you imagine one of these early eighties Casio or sorry, mid to late 80s Casio digital watches. Yeah. It's that. It's basically this unchanged one. The really basic one I was very tempted to go with is sit is just under seventeen dollars. Like if you just want time on a bracelet is seventeen dollars. But recently a friend of mine came to me, uh this is a a a friend of mine that has uh a monster and a technique, sparrowhawk, and he he has some nice watches and he wanted something specifically for travel that would get no attention yeah but had an alarm yeah and a quick access to another time zone and very price sensitive. You know he was traveling through Southeast Asia and and up into Japan. Yeah. And what we ended up selecting was this uh A five hundred WA1ACF. I'm sorry, go to the show notes, is the best I can offer. It is a thirty-nine millimeter resin case of silver on a bracelet. I have no idea how they offer a bracelet for that much money. And it has like a day, date, with a a the time below it, it's digital. And then in the top right corner it shows you like a little world. Oh my gosh. And that world has like an L C D panel above it that gives you the what where the time zone is. Yeah. So you can cycle through the time zone. It's loosely water resistant. I don't they they just say water resistant. They don't say um to how much. But it has an LED backlight, which can be really handy if you're at a hostel or somewhere where you don't even want to turn on a flashlight and maybe bother somebody else in the room. Yeah. Up to five daily alarms also handy, an hourly time signal, a one one hundredth of a second chronograph. Wow. And I actually think it looks very inoffensive. And certainly if you I see this a lot in Vancouver, I think it would depend on the city. But in the last few years there's been a resurgence of these of the popularity of these little digital watches, these simple ones. I see a lot of guys in Vancouver wearing the gold one in sort of a hipstery way. Yeah. Yeah. They're not expensive and and they kind of have a a a retro charm to them that that kind of isn't the same retro charm as say a dive watch. Yeah. Yeah. So twenty five dollars this watch easily manage my friend's trip through Asia and he said was an absolute tool for him and and his girlfriend as they uh navigated uh various uh elements and and and stayed on time and was able to you know track things like the Japanese train system and different things like that. So it was pretty handy, especially when you're outside of maybe data for your phone and you know it gets no attention. It's not the sort of watch that would be stolen from your hotel room if you left it in the hotel room when when you went to the pool or something. Yeah. Right. And uh I I think these are killer and and at twenty five dollars you could actually buy both of our watches for what like seventy eighty dollars. Right. Right. Uh I think both are really cool, and and I think that's exactly where I would leave the sub $250 price point at this point. I would definitely wear this watch. I like its feature set and I really like the timex that you chose. So nicely done with that. Yeah, cool. Great place to exit that that category. That's awesome. Maybe we'll do a sub the sub fifty dollar category some show. At that point we have to buy a bunch of them. Yeah, right. And and just try and and see which one last, like I don't know, even just a sp I'll just I'll put one on Yeah. And see which one's still ticking after a couple of days. Yeah, right. But yeah, so lots of good options there and I think we we really ran the gamut from twenty five dollars up to a little over the price point. So uh if if you have any feedback, anything you want to add, any criticisms, by all means the Grenado at Gmail dot com. We're reading every email and uh we would love your input and like I said if we can amass enough of a new list of watches that T GN listeners love, I'd more than happily address this uh topic again. Uh 'cause I I think it's such a rich price point. It's something accessible and there's lots I clearly there's lots here. There's lots of stuff that we didn't get to. Alright, you want to think uh final notes, kinda put a bow on it? Yeah, let's do it. Yeah, so I've got a a bit of a confession to make. I I've been kind of a uh nerdy fan of of a very arcane um uh I don't even know how to describe it. It's uh it it's sort of a tradition in England, and it's called the shipping forecast. And the shipping forecast is as it sounds. It's something that's broadcast on BBC Radio 4 three or four times a day. It comes through the their Met service or the meteorological office. And it was devised, I think, back in the nineteen thirties or forties as a service to fishermen and and uh you know, c boat captains who were out in the waters around uh Great Britain, which of course is an island nation, and so it's very closely tied to the ocean. And uh basically what it is is it's um uh the the radio announcer comes on at the set times during the day and night and reads off the meteorological data for the different ocean cate or ocean regions around Great Britain. And these ocean regions have very evocative sort of names, um Forth and Tyne and Dogger and German Byte and you know, they have all these really evocative sounding names and and then they they sort of list off these names and after each name they they give the barometric pressure and the kind of the wind category speed and kind of the current conditions. And it has almost this sort of um uh meditative, poetic sort of uh s uh cadence to it uh that they read it. And it i I I've just found it sort of mesmerizing to listen to and and the BBC website actually that there's such a following for this. I think there are a lot of Brits that kind of feel this real kinship or real sort of attachment to the shipping forecast because parents and grandparents kind of grew up hearing this on the radio, and um to me it always kind of conjures up this idea of you know being out kind of in a dark sailboat, kind of bobbing offshore somewhere, wondering if there's a storm coming and maybe you're heating up a a bowl of soup while you're you know bobbing in the dark somewhere and you hear this come on the radio. And and the BBC kind of has tapped into that and they actually provide back episodes, you know, recorded back episodes of the shipping forecast and you could just play them on demand. And and I do this fairly regularly, especially if I'm like when we were in Basel, if I'm lying awake with jet lag and I'm trying to go to sleep, I'll I'll just stream uh an episode of the shipping forecast and they're they're like anywhere between eight and fifteen minutes. So a lot of times it's enough to kind of put you to sleep. Uh and then oftentimes in the last one that they do in the evenings, they'll play um this sort of piece of classical music that sort of leads into the shipping forecast and then after it's over um they play the the national anthem, the the British national anthem and and it kind of fades out from there. And I I've just always kind of found that um it kind of really appeals to my sense of history and and love of all things kind of nautical and maritime. And I I guess I this is kind of a long preamble to to kind of the real final note that I wanted to mention, which was an article in the Atlantic, uh or on their website, the Atlantic magazine's website, called The Men Who Chased Shipwrecks. And it was an article about this this family of men by the name of Gibson who lived in a certain region of of England uh in Cornwall on the sea, and whenever there was uh a shipwreck that they would hear about on the radio, um, they would grab their cameras and they would rush out to you know the shoreline wherever this the ship had you know run aground and they would take these beautiful black and white um kind of large format photos of the of the shipwrecks and and they've produced some amazing images uh over the years dating back to I I don't know like the early nineteen hundreds and and really amazing stuff and so we'll put a link up to this article about it, but there was also a a recent auction in which the the original sort of photography that these guys took from you know the early nineteen hundreds all the way up through the nineteen eighties uh were were being auctioned off and uh it it's very haunting photography. It's it's it's beautiful in sort of a a macabre sort of way because these are black and white photos of of ships that have run aground and are kind of awash and and you know men being rescued and I I I just think between that and the shipping forecast I I just it it sort of conjures up this uh a lot of things that that appeal to me about, you know, shipwrecks in the ocean and and kind of maritime culture and and uh so those are kind of my my first two lead-ins here for uh for final notes. Very cool. Though the photos are just fantastic. Yeah. Yeah. So it's definitely worth reading the article even just to get some context for these photos. I mean they're just the corpses of chips basically on on the rocks in bad water and very dramatic and you you wouldn't believe that's you know well over a hundred years old a lot of the the images they have in that in the article. Fantastic. Yeah. Yeah. So my first for the episode is uh is actually a purchase that I made recently that was better than I expected and I think it's kind of a a a fitting time of year to talk about some of the adventuring gear that isn't watches or bags but so in this case it's a pair of pants and so I recently bought uh I I had kind of wanted them for a while at their the uh the Eddie Bauer Guide Pro pants and I know you have a pair and I think that's kind of where I I saw them and uh you you may have multiple pairs, I'm not sure, but uh I I picked up a pair of these and I was expecting them to be kind of very similar to the uh the kind of multi use climbing pants I have from Patagonia. Yeah. And they are very similar, but they it's just kind of a different layout as far as uh the pockets. Mm-hmm. So there's two there's a pocket on each thigh and they're kind of like a tan material. They call the color saddle and they're drastically less expensive than the Patagoni ones. Currently on the website you can get the Guide Pro Pants for f under fifty dollars in the in the States. Amazing. And I paid uh they were a hundred Canadian but forty percent off. So not not a ton of money either. And I wore them around for uh the day that I bought them and I absolutely love them. They they're not heavy, they dry almost instantaneously. The pocket layout is really nice. The zippers are good on the thigh pockets, and the the back uses uh like a simple velcro to kind of secure whatever's in the pocket without having to deal with a full zipper. And yeah, as as an alternative to some of the more expensive options from a Patagonia or an Arteryx, I think these are killer and there's certainly a price point where you're not going to feel precious about them. Right. Uh so if if you're looking at gearing up for some travel or some hiking, camping, adventuring, that sort of thing. These are definitely would make a a fine layer under a dry suit. I these are the sort of pants I wear kind of all the time on the weekend. Mm-hmm. And uh and yeah, I'm I'm absolutely thrilled. I can keep this one really short. You should definitely buy a pair. Um and and if you're in the States all all the easier 'cause the Eddie Bauer stuff's even cheaper there. Yeah, I think this this totally gets the the TGN stamp of approval from both of us. I I I love them as travel pants. They're great on an airplane. The thigh pocket's perfect for like a passport or your phone. I I've got I don't know if they've got a kind of a slightly less techie a version that that just has kind of one thigh pocket and it's a little bit more uh it's slightly different cut and I I've actually worn it with a sport jacket and and a pair of uh you know decent looking shoes and and you can kinda get away with it. They're uh it's a it's a great great uh great clothing option. Yeah, they make a they make quite a few different pairs of pants and I would say the only thing that gives away the Guide Pro pants as being like even more casual than a pair of jeans, depending on your scenario, is they have that first ascent logo just kind of above the knee on on the left leg. So I mean that's kind of gives them away as sportswear. Right. But while I was at the store, they have a handful of other models that use a similar material, this super light DWR coated uh material that didn't have any thigh pockets and just kinda wore like regular chinos and actually were fairly s slim through the leg. They d they weren't all like billowy and blowy like a pair of tear aways. Right. Uh yeah, I was I was just impressed. I mean, I always like Eddie Bauer stuff 'cause it's it's a really nice mix of price and performance and they have a great warranty. Mm-hmm. Uh but even this stuff kind of uh uh outweighed my expectations and it'll be kind of my core core travel stuff for Clipperton. I think it'll work really well for that. Yeah, I think so too. Um what else do you got? Yeah I I'll finish up with uh just a quick one, you know, 'cause we've talked about the movie uh Blue Water White Death. We brought it up earlier in the show. Um I you know, I love that movie so much, you do too. Um I I found I was just trolling around on iTunes the other day and I found it on iTunes. Um I actually bought it on iTunes for five ninety nine in H D and uh Fantastic. It it's you know it it it's it's awesome. 'Cause the only way other way I had watched that was like streaming it off of YouTube, kind of poor quality. And uh it it's it's even better in HD and and now I can just watch it any time I want, skip ahead through different uh sections of the movie and uh anyway. I I'm not gonna go into too much detail 'cause we've we've talked about this movie quite a bit in past episodes and uh definitely um worth getting on on iTunes if you're if you're into that. Yeah, and I just bought the book uh based on the same story, so I'll be reading that on uh on Clipperton as as something to kinda kill some of the non-internet time. I I don't know what somebody does without internet for that long, but I guess we'll find out. I'll read a bunch of books. And then yeah, my final is actually a a really excellent long read from The Guardian. Jason, you and I are are fairly obsessed with Patagonia because of their founder, uh, Yvonne uh Shinard, and and and we've obviously talked about various interviews that he's given in the past. He has a fantastic one for how I made this with NPR, but this is a uh a long read, a very long article that which I love. I love a good long article, uh, called Patagonia and the North Face Saving the World One Puffer Jacket at a Time. So obviously, in the last couple of years the kind of puffy pillow jackets, the the down jackets have become vogue again. Who knows how long that lasts, but it is uh very much a uh a kind of trend in in outerwear right now and they make such a a widely used jacket but obviously there's there's drastically different standards to which they're made and how are how environmental their their construction is. And uh this is a really fantastic look at kind of not only the similarities between North Face and Patagonia but the differences in their approach to business, one being publicly traded, one being private. And if if you're interested in this sort of thing in and there's a lot of like it's a bit of a tumultuous time for the outerwear industry as they're now siding against governments in various states and abandoning shows and and and it's it's a fun story to see like the history, the kind of rebellious history of some of these brands that are still doing rebellious things today, many, many years later, when they could just take all your money. And and and certainly their businesses, they would they want to make your money, but uh you know, I I love reading these things and and both the North Face and and Patagonia have these fantastic origin stories and it it's this very well written piece. So swing by the show notes and check that out. I had a blast reading it and uh I I like these sorts of uh big articles and it's about a topic that I think falls squarely into the uh TGN mind space. Definitely. Awesome. And I I think that pretty much wraps it up. So as always, thanks so much for listening. Hit the show notes for more details. You can follow us on Instagram at Jason Heaton, I'm at JE Stacy, and you can follow the show at the Greenado. If you have any questions for us, please write thegreenato at gmail.com, and please subscribe and review wherever you find your podcast, or you can grab the feed from thegreenado.com as well. Music Throughout is siesta by Jazzer via the Free Music Archive. Until next time, we leave you with this quote from Cyril Connolly. We must select the illusion which appeals to our temperament and embrace it with passion if we want to be happy.
